In [21]:
import pandas as pd
s1 = pd.Series([1,2,3])
print(s1)

0    1
1    2
2    3
dtype: int64

In [23]:
df = pd.DataFrame({"col1":[1,2],"col2":[3,4]})
df

   col1  col2
0     1     3
1     2     4

In [18]:
s2 = pd.Series([1,2,3],index=['b','c','d'])
s2

b    1
c    2
d    3
dtype: int64

In [19]:
df1 = pd.DataFrame({'name':['alice','thilan','pasindu'],'Age':[25,30,55]})
df1

      name  Age
0    alice   25
1   thilan   30
2  pasindu   55

In [29]:
df2 = pd.DataFrame([{'colA':1,'colB':2,'colC':3},{'colA':4,'colB':3,'colC':5},{'colA':8,'colB':4,'colC':7}],index = ['row1','row2','row3'])
df2

      colA  colB  colC
row1     1     2     3
row2     4     3     5
row3     8     4     7

In [35]:
df1 = pd.DataFrame([1,2,5],index=['a','b','c'],columns=['cl1'])
df2 = pd.DataFrame(df1,index=['a','b'])
df2

   cl1
a    1
b    2

In [38]:
list_of_tuples = [(1,'thila',25),(2,'pasan',25)]
x = pd.DataFrame(list_of_tuples,columns = ['id','name','age'])
x

   id   name  age
0   1  thila   25
1   2  pasan   25

In [43]:
list1 = ['thilan','pasindu','kavindu']
list2 = [24,55,44,88]
tupples = list(zip(list1,list2))
df4 = pd.DataFrame(tupples,columns=["name","age"])
print(df4)

      name  age
0   thilan   24
1  pasindu   55
2  kavindu   44

In [57]:
print(df4.head())
print("#######################")
print(df4.info())
print("#######################")
print(df4.shape)
print("#######################")
print(df4.describe())
print("#######################")
print(df4.columns)
print("#######################")
print(df4.index)
print("#######################")
print(df4.values)
print("#######################")

      name  age
0   thilan   24
1  pasindu   55
2  kavindu   44
#######################
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes
None
#######################
(3, 2)
#######################
             age
count   3.000000
mean   41.000000
std    15.716234
min    24.000000
25%    34.000000
50%    44.000000
75%    49.500000
max    55.000000
#######################
Index(['name', 'age'], dtype='object')
#######################
RangeIndex(start=0, stop=3, step=1)
#######################
[['thilan' 24]
 ['pasindu' 55]
 ['kavindu' 44]]
#######################

In [59]:
list1 = ["Alice","Bob","Charlie","David","Kari","Amilie","Daminan"]
list2 = [25,30,22,28,19,22,27]
list3 = [85,70,90,80,75,77,82]
list4 = ["NewYork","Los_Angles","Frankfrut","London","Oslo","Barcelona","Frankfrut"]


list_of_tuples = list(zip(list1,list2,list3,list4))

df5 = pd.DataFrame(list_of_tuples,columns = ["Name","Age","Score","City"]) 
df5

      Name  Age  Score        City
0    Alice   25     85     NewYork
1      Bob   30     70  Los_Angles
2  Charlie   22     90   Frankfrut
3    David   28     80      London
4     Kari   19     75        Oslo
5   Amilie   22     77   Barcelona
6  Daminan   27     82   Frankfrut

In [63]:
datas = [("Alice",25,85,"NewYork"),("Bob",30,70,"Los_Angles"),("Charlie",22,90,"Frankfrut"),("David",28,80,"London"),("Kari",19,75,"Oslo")
        ,("Amilie",22,77,"Barcelona"),("Daminan",27,82,"Frankfrut")]

df6 = pd.DataFrame(datas,columns = ["Name","Age","Score","City"])
print(df6)

      Name  Age  Score        City
0    Alice   25     85     NewYork
1      Bob   30     70  Los_Angles
2  Charlie   22     90   Frankfrut
3    David   28     80      London
4     Kari   19     75        Oslo
5   Amilie   22     77   Barcelona
6  Daminan   27     82   Frankfrut

In [71]:
print(df6['Name'])
print('######################')
print(df6[['Name',"Score"]])
print('######################')
print(df6[0:2])
print('######################')
print(df6.iloc[:,1:3]) #DataFrame.iloc[ row_selection , column_selection ]
print('######################') 
print(df6.loc[:,['Name','City']])

0      Alice
1        Bob
2    Charlie
3      David
4       Kari
5     Amilie
6    Daminan
Name: Name, dtype: object
######################
      Name  Score
0    Alice     85
1      Bob     70
2  Charlie     90
3    David     80
4     Kari     75
5   Amilie     77
6  Daminan     82
######################
    Name  Age  Score        City
0  Alice   25     85     NewYork
1    Bob   30     70  Los_Angles
######################
   Age  Score
0   25     85
1   30     70
2   22     90
3   28     80
4   19     75
5   22     77
6   27     82
######################
      Name        City
0    Alice     NewYork
1      Bob  Los_Angles
2  Charlie   Frankfrut
3    David      London
4     Kari        Oslo
5   Amilie   Barcelona
6  Daminan   Frankfrut

In [74]:
raw_data = {"First_name":['sheldon','Raj','Leonard','Howard','Amy'],
             "Last_name":['Copper','Kootharapali','Hofstder','Wolwitz','Fowler'],
           "age":[42,38,36,41,35],
           "comedy_score":[9,7,8,8,5],
           "Rating_Score":[25,25,49,62,70]}

df = pd.DataFrame(raw_data)
df

  First_name     Last_name  age  comedy_score  Rating_Score
0    sheldon        Copper   42             9            25
1        Raj  Kootharapali   38             7            25
2    Leonard      Hofstder   36             8            49
3     Howard       Wolwitz   41             8            62
4        Amy        Fowler   35             5            70

In [80]:
print(df.sort_values(by="age",ascending=0))
print('######################')
print(df.sort_values(by="age",ascending=1))
print('######################')
print(df.sort_values(by=["age","comedy_score"]))
print('######################')

  First_name     Last_name  age  comedy_score  Rating_Score
0    sheldon        Copper   42             9            25
3     Howard       Wolwitz   41             8            62
1        Raj  Kootharapali   38             7            25
2    Leonard      Hofstder   36             8            49
4        Amy        Fowler   35             5            70
######################
  First_name     Last_name  age  comedy_score  Rating_Score
4        Amy        Fowler   35             5            70
2    Leonard      Hofstder   36             8            49
1        Raj  Kootharapali   38             7            25
3     Howard       Wolwitz   41             8            62
0    sheldon        Copper   42             9            25
######################
  First_name     Last_name  age  comedy_score  Rating_Score
4        Amy        Fowler   35             5            70
2    Leonard      Hofstder   36             8            49
1        Raj  Kootharapali   38             7            25
3     Howard       Wolwitz   41             8            62
0    sheldon        Copper   42             9            25
######################

In [83]:
g = df.groupby(["age"])
print(g.size())

age
35    1
36    1
38    1
41    1
42    1
dtype: int64

In [85]:
print("index of largest value:",df['age'].idxmax())
print("index of largest value:",df['age'].idxmin())

index of largest value: 0
index of largest value: 4

In [ ]:
A = [1,2,3,4,5]
B = [10,20,30,40,50]
df = pd.DataFrame(list(zip(A,B)))
df